//Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Введите трёхзначное число");
string stringNum = Console.ReadLine() ?? "0";
Console.WriteLine(stringNum[1]);